이 문제가 이분탐색문제라는것을 10억이라는 큰 수를 보고 알았을것이고(물론 주제가 이분탐색이기에 알고있겠지만) 어떤것을 파라미터로 정하는것이 가장 핵심인 문제인것은 다들 아실거라고 생각합니다.

이 문제를 해결하려면 다음에 대한 답을 알고있어야합니다.

"만약에 돌멩이 사이의 거리를 최소한 x 이상만큼 만들기 위해서 최소한으로 제거해야하는 돌멩이의 개수는 몇개인가?"
( 또는 "점프력이 x 미만인 사람은 못건너게 할 때 최소한으로 제거해야하는 돌멩이의 개수는 몇개인가? " 라고 생각해도 좋습니다)

예를들어서 최소한 거리가 1 이상이 되게끔 하려면 제거해야하는 돌멩이의 개수는 몇개인가?
최소한 거리가 2 이상이 되게끔 하려면 제거해야하는 ......................................?
최소한 거리가 16 이상이 되게끔 하려면 제거해야하는 ......................................?
...
최소한 거리가 25 이상이 되게끔 하려면 제거해야하는 ......................................?

이에 대해서 배열에 정리할수 있다면 문제에서 요구하는 제거가능한 돌멩이가 N 개 인데 그때 최소한의 거리의 최대값은 몇개인가? 에 대해서 답이 가능합니다.